//ステートメント文

//Javascriptの記述も基本ルール

//1. 記述の終わりに必ず「;」を入れます。

let msg = "message";
console.log(msg);

//2.空白、改行、タブを含めろことが可能(正しい記述の仕方)

/**
 
 * 文が80列を超えると改行します

 * 改行位置はカッコ、カンマ　「,」 演算子などの直後に限る

 * 文書の途中に改行した場合は、次の行に字下げを加える
 
 */


//3.大文字と小文字を記述する際には注意してください

//console.Log(message)




//よりいい命名を決めるためのルール

//1. わかりやすい名前で決めること

let a = 20;
let b = 30;

let x1 = 40;
let x2 = 50;

//2. 長すぎず、短すぎず
let keyword = "mario";//　⚪︎


//おすすめしない
let keyword_for_search = "luigi";//　x

//場合によって使われることもある
let kw = "marco";//　△

//5.記法ケース

/* javascriptの記法のケース

1. キャメルケース記法　=> lastName => 関数か変数によく使われます。

2. パスカルケース記法　=> LastName => クラス名によく使われます。

3. アンダースコアケース記法　(スネークケース)　=> last_name LAST_NAME => どんな場面でもいいですが、基本的に定数に使われます。（特にDB連携するときによく使う）

4.チェーンケース　（ケバブケース）　=> last-name => 万能です。

*/




